In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb() #this is needed for SQL Alchemy because they need a MySQL Library

### Store CSV into DataFrame


# mortality7

In [2]:
#import csv file
csv_file = "../Resources/morticd07/MortIcd7.csv"
mortality7_df = pd.read_csv(csv_file)
mortality7_df.head()

  Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0  1125,,,1955,07A,A000,1,01,08,107822,40543,1881...
1  1125,,,1955,07A,A000,2,01,08,105750,39632,2160...
2  1125,,,1955,07A,A001,1,01,08,1302,6,14,17,12,1...
3  1125,,,1955,07A,A001,2,01,08,739,4,16,13,17,10...
4  1125,,,1955,07A,A002,1,01,08,69,7,13,4,9,5,13,...

In [3]:
# check columns name
mortality7_df.columns

Index(['Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4'], dtype='object')

In [4]:
# rename only column to "All"
mortality7_df.rename(columns={"Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4":"All"}, inplace = True)

In [5]:
# new data frame with split value columns 
new_mortality7_df = mortality7_df["All"].str.split(",", n = 50, expand = True) 
new_mortality7_df.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,1125,,,1955,07A,A000,1,01,08,107822,...,2013,2727,4126,,,214,40543,,,
1,1125,,,1955,07A,A000,2,01,08,105750,...,1745,3465,5963,,,82,39632,,,
2,1125,,,1955,07A,A001,1,01,08,1302,...,8,6,2,,,1,6,,,
3,1125,,,1955,07A,A001,2,01,08,739,...,2,1,2,,,0,4,,,
4,1125,,,1955,07A,A002,1,01,08,69,...,0,0,0,,,0,7,,,

In [6]:
# mortality7 years from 1950 - 1972
new_mortality7_df.sort_values(3,ascending= True).head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
264443,5150,,,1950,07A,A083,1,01,08,289,...,54,40,21,,,0,0,,,
89349,3150,901,,1950,07A,A004,1,03,08,1,...,0,,,,,0,0,,,
89350,3150,901,,1950,07A,A004,2,03,08,3,...,1,,,,,0,0,,,
89351,3150,901,,1950,07A,A005,1,03,08,5,...,0,,,,,0,1,,,
89352,3150,901,,1950,07A,A005,2,03,08,5,...,0,,,,,0,1,,,

In [7]:
# Rename columns
new_mortality7_df.rename(columns=
                         {0:"country_code", 
                          3:"year", 
                          5:"cause",
                          6:"sex",
                          9:"total_d"}, 
                         inplace = True)
new_mortality7_df.head()

,country_code,1,2,year,4,cause,sex,7,8,total_d,...,29,30,31,32,33,34,35,36,37,38
0,1125,,,1955,07A,A000,1,01,08,107822,...,2013,2727,4126,,,214,40543,,,
1,1125,,,1955,07A,A000,2,01,08,105750,...,1745,3465,5963,,,82,39632,,,
2,1125,,,1955,07A,A001,1,01,08,1302,...,8,6,2,,,1,6,,,
3,1125,,,1955,07A,A001,2,01,08,739,...,2,1,2,,,0,4,,,
4,1125,,,1955,07A,A002,1,01,08,69,...,0,0,0,,,0,7,,,

In [11]:
# in new_mortality7_df, suicide code: A148 (read page 15, documentation). 
mortality7_suicide = new_mortality7_df.loc[new_mortality7_df["cause"]== "A148"].head()
mortality7_suicide.head()

,country_code,1,2,year,4,cause,sex,7,8,total_d,...,29,30,31,32,33,34,35,36,37,38
286,1125,,,1955,07A,A148,1,01,08,12,...,0,1,1,,,0,0,,,
287,1125,,,1955,07A,A148,2,01,08,8,...,0,0,2,,,0,0,,,
578,1125,,,1956,07A,A148,1,01,08,12,...,0,1,0,,,0,0,,,
579,1125,,,1956,07A,A148,2,01,08,5,...,1,0,2,,,0,0,,,
870,1125,,,1957,07A,A148,1,01,08,6,...,1,0,0,,,0,0,,,

In [12]:
s7 = pd.DataFrame()
s7

Empty DataFrame
Columns: []
Index: []

In [13]:
s7["year"] = mortality7_suicide["year"]
s7["total_d"] = mortality7_suicide["total_d"]

s7.head()

     year total_d
286  1955      12
287  1955       8
578  1956      12
579  1956       5
870  1957       6

In [36]:
df7 = s7.groupby("year").sum()
df7.head()

     total_d
year
1955     128
1956     125
1957       6

In [15]:
# records count: 1568 -> new_mortality7_df.loc[new_mortality7_df["cause"]== "A148"].count()

#TODO: count numbers of dofferent countries of the set to use 
#TODO: china has different codes. Read documentation page 37 


# Count of countries found with suicide codes in mortality7 
mortality7_suicide["country_code"].unique()

array(['1125'], dtype=object)

# mortality8

In [16]:
#import csv file
csv_file = "../Resources/morticd08/MortIcd8.csv"
mortality8_df = pd.read_csv(csv_file)
mortality8_df.head()

  Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0  1060,,,1980,08A,A000,1,07,08,1087,375,132,,,,3...
1  1060,,,1980,08A,A000,2,07,08,1194,313,133,,,,4...
2  1060,,,1980,08A,A001,1,07,08,0,0,0,,,,0,,0,,0,...
3  1060,,,1980,08A,A001,2,07,08,0,0,0,,,,0,,0,,0,...
4  1060,,,1980,08A,A002,1,07,08,4,0,1,,,,0,,1,,2,...

In [17]:
new_mortality8_df = mortality8_df["Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4"].str.split(",", n = 50, expand = True) 
new_mortality8_df.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,1060,,,1980,08A,A000,1,07,08,1087,...,161,,,,,0,375,,,
1,1060,,,1980,08A,A000,2,07,08,1194,...,335,,,,,0,313,,,
2,1060,,,1980,08A,A001,1,07,08,0,...,0,,,,,0,0,,,
3,1060,,,1980,08A,A001,2,07,08,0,...,0,,,,,0,0,,,
4,1060,,,1980,08A,A002,1,07,08,4,...,0,,,,,0,0,,,

In [35]:
new_mortality8_df.rename(columns=
                         {0:"country_code", 
                          3:"year", 
                          4:"list",
                          5:"cause",
                          6:"sex",
                          9:"total_d"}, 
                         inplace = True)
new_mortality8_df.head()

,country_code,1,2,year,list,cause,sex,7,8,total_d,...,29,30,31,32,33,34,35,36,37,38
0,1060,,,1980,08A,A000,1,07,08,1087,...,161,,,,,0,375,,,
1,1060,,,1980,08A,A000,2,07,08,1194,...,335,,,,,0,313,,,
2,1060,,,1980,08A,A001,1,07,08,0,...,0,,,,,0,0,,,
3,1060,,,1980,08A,A001,2,07,08,0,...,0,,,,,0,0,,,
4,1060,,,1980,08A,A002,1,07,08,4,...,0,,,,,0,0,,,

In [37]:
mortality8_suicide = new_mortality7_df.loc[new_mortality7_df["cause"]== "A148"].head()
s8 = pd.DataFrame()

s8["year"] = mortality8_suicide["year"]
s8["total_d"] = mortality8_suicide["total_d"]

s8.head()

     year total_d
286  1955      12
287  1955       8
578  1956      12
579  1956       5
870  1957       6

In [40]:
df8 = s8.groupby("year").sum()
df8.head()

     total_d
year
1955     128
1956     125
1957       6

# mortality9

In [22]:
#import csv file
csv_file = "../Resources/morticd09/MortIcd9.csv"
mortality9_df = pd.read_csv(csv_file)
mortality9_df.head()

  Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0  2005,,,1983,09A,B00,1,01,01,36,0,0,0,0,0,0,0,1...
1  2005,,,1983,09A,B00,2,01,01,37,1,1,0,0,0,0,0,0...
2  2005,,,1983,09A,B01,1,01,01,1,0,0,0,0,0,0,0,0,...
3  2005,,,1983,09A,B01,2,01,01,0,0,0,0,0,0,0,0,0,...
4  2005,,,1983,09A,B010,1,01,01,0,0,0,0,0,0,0,0,0...

In [23]:
new_mortality9_df = mortality9_df["Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4"].str.split(",", n = 50, expand = True) 
new_mortality9_df.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,2005,,,1983,09A,B00,1,01,01,36,...,11,5,4,,,1,0,0,0,0
1,2005,,,1983,09A,B00,2,01,01,37,...,2,5,10,,,0,0,0,1,0
2,2005,,,1983,09A,B01,1,01,01,1,...,0,0,0,,,0,0,0,0,0
3,2005,,,1983,09A,B01,2,01,01,0,...,0,0,0,,,0,0,0,0,0
4,2005,,,1983,09A,B010,1,01,01,0,...,0,0,0,,,0,0,0,0,0

In [24]:
# mortality9 years from 1979 - 2013
new_mortality9_df.sort_values(3,ascending=True).head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
287803,3150,,,1979,09B,B012,2,01,08,2,...,1,0,1,,,0,0,,,
620156,4200,,,1979,09B,B48,2,01,01,1,...,0,0,0,,,0,0,0,0,1
620157,4200,,,1979,09B,B480,1,01,01,0,...,0,0,0,,,0,0,0,0,0
620158,4200,,,1979,09B,B480,2,01,01,0,...,0,0,0,,,0,0,0,0,0
620159,4200,,,1979,09B,B481,1,01,01,0,...,0,0,0,,,0,0,0,0,0

In [25]:
#import csv file
csv_file = "../Resources/Morticd10_part1/Morticd10_part1.csv"
mortality10_1_df = pd.read_csv(csv_file)
mortality10_1_df.head()

  Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0  1400,,,2001,101,1000,1,07,08,332,8,2,,,,1,,9,,...
1  1400,,,2001,101,1000,2,07,08,222,11,1,,,,1,,1,...
2  1400,,,2001,101,1001,1,07,08,24,0,0,,,,0,,1,,3...
3  1400,,,2001,101,1001,2,07,08,14,0,0,,,,0,,0,,0...
4  1400,,,2001,101,1002,1,07,08,0,0,0,,,,0,,0,,0,...

In [26]:
new_mortality10_1_df = mortality10_1_df["Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4"].str.split(",", n = 50, expand = True) 
new_mortality10_1_df.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,1400,,,2001,101,1000,1,07,08,332,...,95,,,,,0,8,,,
1,1400,,,2001,101,1000,2,07,08,222,...,112,,,,,0,11,,,
2,1400,,,2001,101,1001,1,07,08,24,...,5,,,,,0,0,,,
3,1400,,,2001,101,1001,2,07,08,14,...,6,,,,,0,0,,,
4,1400,,,2001,101,1002,1,07,08,0,...,0,,,,,0,0,,,

In [27]:
# mortality910_1 years from 1988 - 2004
new_mortality10_1_df.sort_values(3,ascending=True).head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
546183,2330,,,1988,104,J439,1,00,01,9,...,3,0,0,0,0,0,0,0,0,0
546194,2330,,,1988,104,J989,1,00,01,6,...,2,0,0,0,0,0,0,0,0,0
546193,2330,,,1988,104,J869,2,00,01,1,...,0,0,0,0,0,0,0,0,0,1
546192,2330,,,1988,104,J849,2,00,01,1,...,0,1,0,0,0,0,0,0,0,0
546191,2330,,,1988,104,J82,2,00,01,1,...,0,0,0,0,0,0,0,0,0,0

In [28]:
#import csv file
csv_file = "../Resources/Morticd10_part2/Morticd10_part2.csv"
mortality10_2_df = pd.read_csv(csv_file)
mortality10_2_df.head()

  Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4
0  1400,,,2005,101,1000,1,07,08,386,10,0,,,,4,,7,...
1  1400,,,2005,101,1000,2,07,08,287,6,1,,,,2,,4,,...
2  1400,,,2005,101,1001,1,07,08,29,0,0,,,,0,,0,,2...
3  1400,,,2005,101,1001,2,07,08,21,0,0,,,,0,,0,,0...
4  1400,,,2005,101,1002,1,07,08,0,0,0,,,,0,,0,,0,...

In [29]:
new_mortality10_2_df = mortality10_2_df["Country,Admin1,SubDiv,Year,List,Cause,Sex,Frmat,IM_Frmat,Deaths1,Deaths2,Deaths3,Deaths4,Deaths5,Deaths6,Deaths7,Deaths8,Deaths9,Deaths10,Deaths11,Deaths12,Deaths13,Deaths14,Deaths15,Deaths16,Deaths17,Deaths18,Deaths19,Deaths20,Deaths21,Deaths22,Deaths23,Deaths24,Deaths25,Deaths26,IM_Deaths1,IM_Deaths2,IM_Deaths3,IM_Deaths4"].str.split(",", n = 50, expand = True) 
new_mortality10_2_df.head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,1400,,,2005,101,1000,1,07,08,386,...,136,,,,,0,10,,,
1,1400,,,2005,101,1000,2,07,08,287,...,163,,,,,0,6,,,
2,1400,,,2005,101,1001,1,07,08,29,...,13,,,,,0,0,,,
3,1400,,,2005,101,1001,2,07,08,21,...,16,,,,,0,0,,,
4,1400,,,2005,101,1002,1,07,08,0,...,0,,,,,0,0,,,

In [30]:
# mortality910_2 years from 2005 - 2017
new_mortality10_2_df.sort_values(3,ascending=True).head()

,0,1,2,3,4,5,6,7,8,9,...,29,30,31,32,33,34,35,36,37,38
0,1400,,,2005,101,1000,1,07,08,386,...,136,,,,,0,10,,,
157108,4186,,,2005,103,V03,1,01,01,96,...,2,2,1,,,0,0,0,0,0
157107,4186,,,2005,103,V02,2,01,01,1,...,0,0,0,,,0,0,0,0,0
157106,4186,,,2005,103,R99,2,01,01,3,...,0,1,0,,,0,0,0,0,0
157105,4186,,,2005,103,R99,1,01,01,10,...,0,0,0,,,0,0,0,0,0

In [31]:
#'e''''''''''
# making seperate last name column from new data frame 
data["Last Name"]= new[1] 
  
# Dropping old Name columns 
data.drop(columns =["Name"], inplace = True) 
  
# df display 
data

NameError: name 'new' is not defined

### Create new data with select columns

In [ ]:
new_customer_data_df = customer_data_df[['id', 'first_name', 'last_name']].copy()
new_customer_data_df.head()

### Store JSON data into a DataFrame

In [ ]:
json_file = "../Resources/customer_location.json"
customer_location_df = pd.read_json(json_file)
customer_location_df.head()

### Clean DataFrame

In [ ]:
new_customer_location_df = customer_location_df[["id", "address", "us_state"]].copy()
new_customer_location_df.head()

### Connect to local database

In [ ]:
rds_connection_string = "<inser user name>:<insert password>@127.0.0.1/customer_db"
engine = create_engine(f'mysql://{rds_connection_string}')

### Check for tables

In [ ]:
engine.table_names()

### Use pandas to load csv converted DataFrame into database

In [ ]:
new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [ ]:
new_customer_location_df.to_sql(name='customer_location', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [ ]:
pd.read_sql_query('select * from customer_name', con=engine).head()

### Confirm data has been added by querying the customer_location table

In [ ]:
pd.read_sql_query('select * from customer_location', con=engine).head()